Config/Documents/СписаниеОбъектаОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>СписаниеОбъектаОС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СтоимостьОбъектовОС</xr:Item>
				<xr:Item>InformationRegister.УчетныеДанныеОбъектаОС</xr:Item>
				<xr:Item>InformationRegister.СобытияОС</xr:Item>
				<xr:Item>AccumulationRegister.АмортизацияОбъектовОС</xr:Item>
				<xr:Item>AccountingRegister.ЖурналПроводокЕПСБУ</xr:Item>
				<xr:Item>AccumulationRegister.СтоимостьОбъектовОСПоКонтрагентам</xr:Item>
				<xr:Item>AccumulationRegister.ОборотыРасчетовСУчредителями</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦМО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦМО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеДляАкта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОснованияДляАкта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОснованияДляАкта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КФО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьПредседателяКомиссии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФамилияПредседателяКомиссии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПредседателяКомиссии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчествоПредседателяКомиссии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаАмортизации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаСписания</Name>
					<Comment>Текст причины списания для печати в акте</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПричинаСписания</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнвентарныйНомер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнвентарныеНомераОС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приложение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСписанияСБухУчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДИсточника</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставКомиссии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДолжностьЧленаКомиссии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФамилияЧленаКомиссии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяЧленаКомиссии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтчествоЧленаКомиссии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/AccountingRegisters/ЖурналПроводокЕПСБУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccountingRegister>
		<Properties>
			<Name>ЖурналПроводокЕПСБУ</Name>
			<ChartOfAccounts>ChartOfAccounts.ЕПСБУ</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КПС</Name>
					<Comment>Классификационный признак счета</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.УчетПоКПС</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КЭК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.УчетПоКЭК</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИФО</Name>
					<Comment>Источник финансового обеспечения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.УчетПоПодразделениям</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЖурналОпераций</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Журналы</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КФО</Name>
					<Comment>Код финансового обеспечения</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНеУчитываетсяНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.НалоговыйУчетНеУчитываемых</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЕНВД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.НалоговыйУчетЕНВД</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.НалоговыйУчетНДС</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаДвиженияДт</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаДвиженияКт</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМежотчетногоПериода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыМежотчетногоПериода</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Config/Enums/ВидыОперацийСписанияОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийСписанияОС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СписаниеСобственныхОС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеКапвложений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеСобственныхОСОперУчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеОСПолученныхВПользование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеОСнаХранении</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Documents/СписаниеОбъектаОС/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти
	
#Область ПроведениеДокумента

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, "СчетУчета");
	
	Если БухгалтерскийУчетКлиентСервер.СчетВИерархии(РеквизитыДокумента.СчетУчета, "101.00,102.00,103.00") Тогда
		ВидОперации = Перечисления.ВидыОперацийСписанияОС.СписаниеСобственныхОС;
		ПолучитьКонтрагента = Ложь;
	ИначеЕсли БухгалтерскийУчетКлиентСервер.СчетВИерархии(РеквизитыДокумента.СчетУчета, "21") Тогда
		ВидОперации = Перечисления.ВидыОперацийСписанияОС.СписаниеСобственныхОСОперУчет;
		ПолучитьКонтрагента = Ложь;
	ИначеЕсли БухгалтерскийУчетКлиентСервер.СчетВИерархии(РеквизитыДокумента.СчетУчета, "01") Тогда	
		ВидОперации = Перечисления.ВидыОперацийСписанияОС.СписаниеОСПолученныхВПользование;
		ПолучитьКонтрагента = Истина;
	ИначеЕсли БухгалтерскийУчетКлиентСервер.СчетВИерархии(РеквизитыДокумента.СчетУчета, "02") Тогда	
		ВидОперации = Перечисления.ВидыОперацийСписанияОС.СписаниеОСнаХранении;
		ПолучитьКонтрагента = Истина;
	Иначе
		ВидОперации = Неопределено;
		ПолучитьКонтрагента = Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка"			, ДокументСсылка);
	Запрос.УстановитьПараметр("Контрагент"		, Справочники.Контрагенты.ПустаяСсылка());
	Запрос.УстановитьПараметр("ИмяДокумента"	, "Списание объекта ОС (Акт списания ОС-4)");
	
	НомераТаблиц = Новый Структура;
	
	НомераТаблиц.Вставить("ТаблицаОсновныеСредства", НомераТаблиц.Количество());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаОсновныеСредства.Ссылка КАК Ссылка,
	|	ТаблицаОсновныеСредства.Номер КАК Номер,
	|	ТаблицаОсновныеСредства.Дата КАК Дата,
	|	ТаблицаОсновныеСредства.ДатаСписанияСБухУчета КАК ДатаСписанияСБухУчета,
	|	ТаблицаОсновныеСредства.Организация КАК Организация,
	|	ТаблицаОсновныеСредства.Подразделение КАК Подразделение,
	|	ТаблицаОсновныеСредства.ЦМО КАК ЦМО,
	|	ТаблицаОсновныеСредства.Номер КАК НомерДокумента,
	|	ТаблицаОсновныеСредства.Дата КАК ДатаДокумента,
	|	&ИмяДокумента КАК НазваниеДокумента,
	|	&Контрагент КАК Контрагент,
	|	ТаблицаОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ТаблицаОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	1 КАК Количество,
	|	ТаблицаОсновныеСредства.Сумма КАК Сумма,
	|	ТаблицаОсновныеСредства.СуммаАмортизации КАК СуммаАмортизации,
	|	ТаблицаОсновныеСредства.ПричинаСписания КАК ПричинаСписания
	|ПОМЕСТИТЬ ТаблицаОсновныеСредства
	|ИЗ
	|	Документ.СписаниеОбъектаОС КАК ТаблицаОсновныеСредства
	|ГДЕ
	|	ТаблицаОсновныеСредства.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	ИнвентарныйНомер";
	
	НомераТаблиц.Вставить("МестонахождениеОС", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ
	|	ТаблицаОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ТаблицаОсновныеСредства.Организация КАК Организация,
	|	ТаблицаОсновныеСредства.ИнвентарныйНомер КАК ИнвНомер,
	|	ТаблицаОсновныеСредства.ЦМО КАК ЦМО,
	|	ТаблицаОсновныеСредства.Подразделение КАК Подразделение,
	|	ЗНАЧЕНИЕ(Перечисление.СостоянияОС.СнятоСУчета) КАК Состояние,
	|	ТаблицаОсновныеСредства.НазваниеДокумента КАК НазваниеДокумента,
	|	ТаблицаОсновныеСредства.НомерДокумента КАК НомерДокумента,
	|	ТаблицаОсновныеСредства.ДатаДокумента КАК ДатаДокумента,
	|	ТаблицаОсновныеСредства.Ссылка КАК Регистратор,
	|	ТаблицаОсновныеСредства.ДатаСписанияСБухУчета КАК Период
	|ИЗ
	|	ТаблицаОсновныеСредства КАК ТаблицаОсновныеСредства";
	
	НомераТаблиц.Вставить("СобытияОС", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ
	|	ТаблицаОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ТаблицаОсновныеСредства.Организация КАК Организация,
	|	ТаблицаОсновныеСредства.ИнвентарныйНомер КАК ИнвНомер,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Списание) КАК Событие,
	|	ТаблицаОсновныеСредства.ДатаСписанияСБухУчета КАК ДатаСобытия,
	|	ТаблицаОсновныеСредства.НазваниеДокумента КАК НазваниеДокумента,
	|	ТаблицаОсновныеСредства.НомерДокумента КАК НомерДокумента,
	|	ТаблицаОсновныеСредства.ДатаДокумента КАК ДатаДокумента,
	|	ТаблицаОсновныеСредства.Ссылка КАК Регистратор,
	|	ТаблицаОсновныеСредства.ДатаСписанияСБухУчета КАК Период,
	|	ТаблицаОсновныеСредства.ПричинаСписания КАК ПричинаСписания
	|ИЗ
	|	ТаблицаОсновныеСредства КАК ТаблицаОсновныеСредства";
	
	Если ВидОперации <> Неопределено Тогда
		// Движения по регистрам СтоимостьОбъектовОС и АмортизацияОбъектовОС.
		ПараметрыСписания = УправлениеОсновнымиСредствами.ПараметрыСписанияОСПоРегистрамНакопления(ВидОперации);
		УправлениеОсновнымиСредствами.ДобавитьТаблицыСписанияОСПоРегистрамНакопления(Запрос, НомераТаблиц,
			ДокументСсылка, ПараметрыСписания);
		Если ПолучитьКонтрагента Тогда
			ТаблицаОС = БухгалтерскиеОперацииПовтИсп.ПолучитьОстаткиОСЗабаланс(ДокументСсылка);
			Запрос.УстановитьПараметр("Контрагент", ТаблицаОС[0]["Контрагент"]);		
		КонецЕсли;
	КонецЕсли;
	
	Результат = Запрос.ВыполнитьПакет();
	
	ОбщегоНазначенияБГУ.ВыгрузитьТаблицыЗапроса(СтруктураДополнительныеСвойства.ТаблицыДляДвижений, Результат, НомераТаблиц);
	
КонецПроцедуры

#КонецОбласти

#Область ПечатьДокумента

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.СписаниеОбъектаОС";
	КомандаПечати.Идентификатор		= "ОС4";
	КомандаПечати.Представление		= НСтр("ru = 'Акт о списании объекта ОС (ОС-4)'");
	КомандаПечати.Порядок			= 1;
	
КонецПроцедуры

// Формирует печатные формы объектов
//
// Параметры
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ОбъектыПечати    - СписокЗначений   - Соответствие между объектами и именами печатных
//						областей, куда распечатан объект
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	Перем ТабличныйДокумент1, ТабличныйДокумент2, ТабличныйДокумент3;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм,"ОС4") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,"ОС4","ОС-4", ПодготовитьОС4(МассивОбъектов, ОбъектыПечати));
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПодготовитьОС4(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СписаниеИнвентарногоОбъектаОС_ОС4";

	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЖурналПроводокЕПСБУДвиженияССубконто.Сумма КАК Сумма,
	               |	ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ ВсеДвижения
	               |ИЗ
	               |	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ДвиженияССубконто(
	               |			,
	               |			,
	               |			Регистратор В (&МассивОбъектов)
	               |				И СчетКт В (&Счет104),
	               |			,
	               |			) КАК ЖурналПроводокЕПСБУДвиженияССубконто
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Регистратор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СписаниеОбъектаОС.Ссылка КАК Ссылка,
	               |	СписаниеОбъектаОС.Дата КАК пДата,
	               |	СписаниеОбъектаОС.Номер КАК НомерАкта,
	               |	СписаниеОбъектаОС.Организация КАК Организация,
	               |	СписаниеОбъектаОС.Организация.НаименованиеПолное КАК ОргНазв,
	               |	СписаниеОбъектаОС.Организация.КодОКПО КАК КодОКПО,
	               |	ПРЕДСТАВЛЕНИЕ(СписаниеОбъектаОС.Подразделение) КАК Подразделение,
	               |	СписаниеОбъектаОС.ОснованиеДляАкта КАК ОснованиеДляАкта,
	               |	СписаниеОбъектаОС.НомерОснованияДляАкта КАК НомерОснованияДляАкта,
	               |	СписаниеОбъектаОС.ДатаОснованияДляАкта КАК ДатаОснованияДляАкта,
	               |	СписаниеОбъектаОС.ДатаСписанияСБухУчета КАК ДатаСписания,
	               |	ПРЕДСТАВЛЕНИЕ(СписаниеОбъектаОС.КФО) КАК КФО,
	               |	ПРЕДСТАВЛЕНИЕ(СписаниеОбъектаОС.КПС) КАК КПС,
	               |	СписаниеОбъектаОС.ОсновноеСредство.КодОКОФ.Код КАК пКодПоОКОФ,
	               |	ВЫБОР
	               |		КОГДА СписаниеОбъектаОС.ОсновноеСредство.АмортизационнаяГруппа = ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ПустаяСсылка)
	               |			ТОГДА """"
	               |		ИНАЧЕ СписаниеОбъектаОС.ОсновноеСредство.АмортизационнаяГруппа.Порядок + 1
	               |	КОНЕЦ КАК НомерАмортГруппы,
	               |	ПРЕДСТАВЛЕНИЕ(СписаниеОбъектаОС.ИнвентарныйНомер) КАК ИнвНомер,
	               |	СписаниеОбъектаОС.ИнвентарныйНомер.ЗаводскойНомер КАК пЗавНомер,
	               |	СписаниеОбъектаОС.ОсновноеСредство.ИзготовительОС.НаименованиеПолное КАК Изготовитель,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(СобытияОС_ПринятиеКУчету.ДатаСобытия, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	               |			ТОГДА СобытияОС_ПринятиеКУчету.Период
	               |		ИНАЧЕ СобытияОС_ПринятиеКУчету.ДатаСобытия
	               |	КОНЕЦ КАК ДатаВвода,
	               |	СписаниеОбъектаОС.ИнвентарныйНомер.ДатаВыпуска КАК ДатаВыпуска,
	               |	СписаниеОбъектаОС.СуммаАмортизации + ЕСТЬNULL(ВсеДвижения.Сумма, 0) КАК НачАмортизация,
	               |	СписаниеОбъектаОС.Сумма - СписаниеОбъектаОС.СуммаАмортизации - ЕСТЬNULL(ВсеДвижения.Сумма, 0) КАК ОстСтоимость,
	               |	СписаниеОбъектаОС.ЦМО.Сотрудник КАК МОЛ,
	               |	СписаниеОбъектаОС.ДолжностьПредседателяКомиссии КАК ДолжностьПредседателяКомиссии,
	               |	СписаниеОбъектаОС.ФамилияПредседателяКомиссии КАК ФамилияПредседателяКомиссии,
	               |	СписаниеОбъектаОС.ИмяПредседателяКомиссии КАК ИмяПредседателяКомиссии,
	               |	СписаниеОбъектаОС.ОтчествоПредседателяКомиссии КАК ОтчествоПредседателяКомиссии,
	               |	СписаниеОбъектаОС.ЦМО.Сотрудник.Код КАК ТабНомМОЛ,
	               |	СписаниеОбъектаОС.ОсновноеСредство КАК ОсновноеСредство,
	               |	ВЫБОР
	               |		КОГДА СписаниеОбъектаОС.ОсновноеСредство.НаименованиеПолное = """"
	               |			ТОГДА СписаниеОбъектаОС.ОсновноеСредство.Наименование
	               |		ИНАЧЕ СписаниеОбъектаОС.ОсновноеСредство.НаименованиеПолное
	               |	КОНЕЦ КАК НаимОС,
	               |	СписаниеОбъектаОС.ПричинаСписания КАК ТекстПричинаСписания,
	               |	СписаниеОбъектаОС.Приложение КАК ТекстПриложения,
	               |	СписаниеОбъектаОС.Сумма КАК НачСтоимость,
	               |	СписаниеОбъектаОС.ИнвентарныйНомер КАК ИнвентарныйНомер
	               |ИЗ
	               |	Документ.СписаниеОбъектаОС КАК СписаниеОбъектаОС
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СобытияОС КАК СобытияОС_ПринятиеКУчету
	               |		ПО СписаниеОбъектаОС.ОсновноеСредство = СобытияОС_ПринятиеКУчету.ОсновноеСредство
	               |			И (СобытияОС_ПринятиеКУчету.Событие = &ПринятиеКУчету)
	               |			И СписаниеОбъектаОС.ИнвентарныйНомер = СобытияОС_ПринятиеКУчету.ИнвНомер
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВсеДвижения КАК ВсеДвижения
	               |		ПО СписаниеОбъектаОС.Ссылка = ВсеДвижения.Регистратор
	               |ГДЕ
	               |	СписаниеОбъектаОС.Ссылка В(&МассивОбъектов)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	пДата,
	               |	НомерАкта
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	НаличиеДрагМатериаловВОбъектахНФАОстатки.ОбъектНФА КАК ОсновноеСредство,
	               |	ВЫРАЗИТЬ(НаличиеДрагМатериаловВОбъектахНФАОстатки.ОбъектНФА КАК Справочник.ОсновныеСредства).НаименованиеПолное + "" / "" + ВЫРАЗИТЬ(НаличиеДрагМатериаловВОбъектахНФАОстатки.ИнвНомер КАК Справочник.ИнвентарныеНомераОС).Код КАК НазвДетали,
	               |	ВЫРАЗИТЬ(НаличиеДрагМатериаловВОбъектахНФАОстатки.ВидДрагМатериала КАК Справочник.ДрагМеталлы).Наименование КАК Драгметалл,
	               |	ВЫРАЗИТЬ(НаличиеДрагМатериаловВОбъектахНФАОстатки.ВидДрагМатериала КАК Справочник.ДрагМеталлы).Код КАК КодДрагМеталла,
	               |	ВЫРАЗИТЬ(НаличиеДрагМатериаловВОбъектахНФАОстатки.ЕдИзм КАК Справочник.КлассификаторЕдиницИзмерения).Наименование КАК НазвЕИ,
	               |	ЕСТЬNULL(НаличиеДрагМатериаловВОбъектахНФАОстатки.МассаДМОстаток, 0) КАК ВесДраг
	               |ИЗ
	               |	Документ.СписаниеОбъектаОС КАК СписаниеОбъектаОС
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.НаличиеДрагМатериаловВОбъектахНФА.Остатки КАК НаличиеДрагМатериаловВОбъектахНФАОстатки
	               |		ПО СписаниеОбъектаОС.ОсновноеСредство = НаличиеДрагМатериаловВОбъектахНФАОстатки.ОбъектНФА
	               |			И СписаниеОбъектаОС.ИнвентарныйНомер = НаличиеДрагМатериаловВОбъектахНФАОстатки.ИнвНомер
	               |ГДЕ
	               |	СписаниеОбъектаОС.Ссылка В(&МассивОбъектов)
	               |ИТОГИ ПО
	               |	ОсновноеСредство
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СписаниеОбъектаОССоставКомиссии.ДолжностьЧленаКомиссии КАК ДолжностьЧленаКомиссии,
	               |	СписаниеОбъектаОССоставКомиссии.ФамилияЧленаКомиссии КАК ФамилияЧленаКомиссии,
	               |	СписаниеОбъектаОССоставКомиссии.ИмяЧленаКомиссии КАК ИмяЧленаКомиссии,
	               |	СписаниеОбъектаОССоставКомиссии.ОтчествоЧленаКомиссии КАК ОтчествоЧленаКомиссии,
	               |	СписаниеОбъектаОССоставКомиссии.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.СписаниеОбъектаОС.СоставКомиссии КАК СписаниеОбъектаОССоставКомиссии
	               |ГДЕ
	               |	СписаниеОбъектаОССоставКомиссии.Ссылка В(&МассивОбъектов)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	СписаниеОбъектаОССоставКомиссии.НомерСтроки
	               |ИТОГИ ПО
	               |	Ссылка";
				   
	Запрос.УстановитьПараметр("МассивОбъектов"	, МассивОбъектов);
	Запрос.УстановитьПараметр("ПринятиеКУчету"	, Перечисления.ВидыСобытийОС.ПринятиеКУчету);
	Запрос.УстановитьПараметр("Счет104"			, БухгалтерскийУчет.СписокСчетов("104.00"));
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.ВыполнитьПакет();
	
	ВыборкаШапка 			= Результат[1].Выбрать();
	ВыборкаДрагМеталлы 		= Результат[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаКомиссия 		= Результат[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_ОС_4");
	ОблАкт			= Макет.ПолучитьОбласть("Акт");
	ОблАкт_2		= Макет.ПолучитьОбласть("Акт_2");
	ОблДрагметалл	= Макет.ПолучитьОбласть("Драгметалл");
	ОблДрагметалл_2	= Макет.ПолучитьОбласть("Драгметалл_2");
	ОблАкт_2_2		= Макет.ПолучитьОбласть("Акт_2_2");
	ОблКомиссия		= Макет.ПолучитьОбласть("Комиссия");
	ОблАкт_3		= Макет.ПолучитьОбласть("Акт_3");
	
	ПервыйДокумент = Истина;
	
	Пока ВыборкаШапка.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ОтветственныеЛица = ОрганизационнаяСтруктураПовтИсп.ОтветственныеЛицаОрганизации(ВыборкаШапка.Организация, ВыборкаШапка.пДата);
		
		ОблАкт.Параметры.Заполнить(ВыборкаШапка);
		СтруктураОблАкт = Новый Структура("РукДолжн,ОргДиректор,СрокЭкспл,НомерАкта");
		СтрРуководитель = ОтветственныеЛица.Найти(Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
		Если СтрРуководитель<>Неопределено Тогда
			СтруктураОблАкт.РукДолжн = СтрРуководитель.ДолжностьПредставление;
			ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество", СтрРуководитель.ОтветственноеЛицоСсылка, ВыборкаШапка.пДата);
			Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
			СтруктураОблАкт.ОргДиректор = КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина);
		КонецЕсли;
		
		СтруктураОблАкт.СрокЭкспл = УправлениеОсновнымиСредствами.РассчитатьСрокЭксплуатации(	ВыборкаШапка.ОсновноеСредство,
																								ВыборкаШапка.ИнвентарныйНомер,
																								ВыборкаШапка.Организация,
																								ВыборкаШапка.пДата).СрокЭкспл;
		СтруктураОблАкт.НомерАкта = ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(ВыборкаШапка.Ссылка,ВыборкаШапка.НомерАкта);
		ОблАкт.Параметры.Заполнить(СтруктураОблАкт);
		ТабличныйДокумент.Вывести(ОблАкт);
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		ТабличныйДокумент.Вывести(ОблАкт_2);
		
		// драгметаллы
		ВыборкаДрагМеталлы.Сбросить();
		ВывелиСтрок = 0;
		Если ВыборкаДрагМеталлы.НайтиСледующий(ВыборкаШапка.ОсновноеСредство, "ОсновноеСредство") Тогда
			
			ДрагМеталлы = ВыборкаДрагМеталлы.Выбрать();
			Пока ДрагМеталлы.Следующий() Цикл
				
				ОблДрагметалл.Параметры.Заполнить(ДрагМеталлы);
				ТабличныйДокумент.Вывести(ОблДрагметалл);
				ВывелиСтрок = ВывелиСтрок + 1;
				
			КонецЦикла;
			
		КонецЕсли;
		Для Счетчик = ВывелиСтрок По 3 Цикл
			ТабличныйДокумент.Вывести(ОблДрагметалл_2);
		КонецЦикла;
		
		ОблАкт_2_2.Параметры.Заполнить(ВыборкаШапка);
		ТабличныйДокумент.Вывести(ОблАкт_2_2);
		
		// Комиссия
		пСтатусЧленаКомиссии	= "Председатель комиссии";
		пДолжностьЧленаКомиссии = ВыборкаШапка.ДолжностьПредседателяКомиссии;
		Если ЗначениеЗаполнено(ВыборкаШапка.ФамилияПредседателяКомиссии) Тогда
			пЧленКомиссии			= КорреспондентыКлиентСервер.ФИО(Новый Структура("Фамилия, Имя, Отчество",
	               																ВыборкаШапка.ФамилияПредседателяКомиссии,
	               																ВыборкаШапка.ИмяПредседателяКомиссии,
	               																ВыборкаШапка.ОтчествоПредседателяКомиссии));
		Иначе																				
			пЧленКомиссии			= "";
		КонецЕсли;
		СтуктураОблКомиссия = Новый Структура("пСтатусЧленаКомиссии,пДолжностьЧленаКомиссии,пЧленКомиссии",
												пСтатусЧленаКомиссии,пДолжностьЧленаКомиссии,пЧленКомиссии);
		ОблКомиссия.Параметры.Заполнить(СтуктураОблКомиссия);
		ТабличныйДокумент.Вывести(ОблКомиссия);
		
		пСтатусЧленаКомиссии = "Члены комиссии:";
		ВыборкаКомиссия.Сбросить();
		ВывелиСтрок = 0;
		Если ВыборкаКомиссия.НайтиСледующий(ВыборкаШапка.Ссылка, "Ссылка") Тогда
			
			Комиссия = ВыборкаКомиссия.Выбрать();
			Пока Комиссия.Следующий() Цикл
				ВывелиСтрок = ВывелиСтрок + 1;
				пДолжностьЧленаКомиссии = Комиссия.ДолжностьЧленаКомиссии;
				пЧленКомиссии			= КорреспондентыКлиентСервер.ФИО(Новый Структура("Фамилия, Имя, Отчество",
			               																Комиссия.ФамилияЧленаКомиссии,
			               																Комиссия.ИмяЧленаКомиссии,
			               																Комиссия.ОтчествоЧленаКомиссии));
				СтуктураОблКомиссия = Новый Структура("пСтатусЧленаКомиссии,пДолжностьЧленаКомиссии,пЧленКомиссии",
												пСтатусЧленаКомиссии,пДолжностьЧленаКомиссии,пЧленКомиссии);
				ОблКомиссия.Параметры.Заполнить(СтуктураОблКомиссия);
				ТабличныйДокумент.Вывести(ОблКомиссия);
				
				пСтатусЧленаКомиссии = "";
				
			КонецЦикла;
			
		КонецЕсли;
		Для Счетчик=ВывелиСтрок По 2 Цикл
			СтуктураОблКомиссия = Новый Структура("пСтатусЧленаКомиссии,пДолжностьЧленаКомиссии,пЧленКомиссии",
												пСтатусЧленаКомиссии,"","");
			ОблКомиссия.Параметры.Заполнить(СтуктураОблКомиссия);
			ТабличныйДокумент.Вывести(ОблКомиссия);
			
			пСтатусЧленаКомиссии = "";
		КонецЦикла;
		
		СтрГлБухгалтер = ОтветственныеЛица.Найти(Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер);
		Если СтрГлБухгалтер<>Неопределено Тогда
			ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество", СтрГлБухгалтер.ОтветственноеЛицоСсылка, ВыборкаШапка.пДата);
			Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
			ОблАкт_3.Параметры.Заполнить(Новый Структура("ОргБухгалтер", КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина)));
		Иначе
			ОблАкт_3.Параметры.Заполнить(Новый Структура("ОргБухгалтер", ""));
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОблАкт_3);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		                                               НомерСтрокиНачало, ОбъектыПечати, ВыборкаШапка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти

#КонецЕсли
